---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.HooksAndEndTreatmentAtTheSameEnd
source: html/62341bf1-5acd-c5a7-0f00-b9e3d7325513.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.HooksAndEndTreatmentAtTheSameEnd Property

Cannot add hooks and end treatments at the same end.

## Syntax (C#)
```csharp
public static FailureDefinitionId HooksAndEndTreatmentAtTheSameEnd { get; }
```